
	/*std::cout << "¬ведите диаметр окружности в см\n";
	double d,c,S,z,x;
	std::cin >> d;
	c = d * 3.14;
	z = d / 2;
	x = z * z;
	S = 3.14 * x;
	std::cout << S << " кв.см\tѕлощадь \n" << c << " см\tƒлинна окружности ";
	*/
	/*std::cout << "¬ведите 3 числа через пробел \n";
	double p, v, t,s, p1, a;
	std::cin >> p >> v >> t;
	s = p + v + t;
	p1 = p * v * t;
	a = s / 3;
	std::cout << s << " —умма 3х ваших чисел\n" << p1 << " произведение 3х ваших чисел \n" << a << " —реднее арефмитическое 3х ваших чисел";
	*/
	/*std::cout << "¬ведите сумму продаж за мес€ц\n";
	double s,a,d;
	std::cin >> s;
	a = s / 100 * 5;
	d = a + 1000;
	std::cout << d << " зарплата которую получит менеджер с %ом от продаж \n";

	*/

