/*#include  <iostream>;
int main() {
	setlocale(LC_ALL, "Russian");
	//задание 1
	/*std::cout << "Введите 6ти значное целое число чтоб узнать счасливое оно или нет\n";
	int a, a6, a5, a4, a3, a2, a1, c, c1, c2, w,w1,w2;
	std::cin >> a;
	w = (a > 99999);
	w2 = (a < 999999);
	if (a > 99999 && a<1000000)

	{
		a6 = a % 10;
		c = a / 10;
		a5 = c % 10;
		c = c / 10;
		a4 = c % 10;
		c = c / 10;
		a3 = c % 10;
		c = c / 10;
		a2 = c % 10;
		a1 = c / 10;
		c1 = a1 + a2 + a3;
		c2 = a4 + a5 + a6;


		if (c1 == c2)
		{
			std::cout << " Ваше число счасливое,Гц епта\n";
		}
		else if (c1 < c2)
		{
			std::cout << " Ваше чесло не счасливое\n";
		}
		else if (c1 > c2)
		{
		std::cout << " Ваше число не счасливое\n";
		}
	}


	bool m = false;

	if (m)
	{
		std::cout << "";
	}
	else if (a < 99999 || a>1000000)
	{
		std::cout << "ОШИБКА";
	}

		*/




		//задание 2
		/*std::cout << "Введите 4x значное целое число чтоб я поменял его\n";
		int a, a4, a3, a2, a1, c, b1, b2, b3, b4, q,c1,c2,c3,c4;
		std::cin >> a;
		q = (a < 999 && a>10000);
		if (a > 999 && a < 10000)
		{
			a4 = a % 10;
			c = a / 10;
			a3 = c % 10;
			c = c / 10;
			a2 = c % 10;
			a1 = c / 10;
			if (a4 == 0)
			{
				b4 = a4 + 3;
			}
			else if (a4 == 9)
			{
				b4 = a4 - 2;
			}
			else if (a4 > 1 || a4 < 8)
			{
				b4 = a4 - 1;
			}
			if (a3 == 0)
			{
				b3 = a3 + 2;
			}
			else if (a3 == 9)
			{
				b3 = a3 - 4;
			}
			else if (a3 > 1 || a3 < 8)
			{
				b3 = a3 + 1;
			}

			if (a2 == 0)
			{
				b2 = a2 + 7;
			}
			else if (a2 == 9)
			{
				b2 = a2 - 6;
			}
			else if (a2 > 1 || a2 < 8)
			{
				b2 = a2 - 1;
			}
				if (a1 == 0)
				{
					b1 = a1 + 2;
				}
				else if (a1 == 9)
				{
					b1 = a1 - 1;

				}
				else if (a1 > 1 || a1 < 8)
				{
					b1 = a1 + 1;
				}
			}

			std::cout << b1 << "" << b2 << "" << b3 << "" << b4 << " я его поменял";



		bool w = false;
		if (w)
		{
			std::cout << "";
		}
		else if (a < 999 || a>10000)
		{
			std::cout << "Ваше число не верное в нем больше или меньше 4х цифр";
		}*/
		// Задание 3
	/*std::cout << "Введите 7 целых чисел через пробел чтоб узнать какое из них больше\n";
	int a1, a2, a3, a4, a5, a6, a7, b1, b2, b3, b4, b5, b6, b7, c;
	std::cin >> a1 >> a2 >> a3 >> a4 >> a5 >> a6 >> a7;
	if (a1 > a2)
	{
		c = a1;
	}
	else
	{
		c = a2;
	}

	if (a3 > c)
	{
		c = a3;
	}
	if (a4 > c)
	{
		c = a4;
	}
	if (a5 > c)
	{
		c = a5;
	}
	if (a6 > c)
	{
		c = a6;
	}
	if (a7 > c)
	{
		c = a7;
	}
	std::cout << c << " Самое большое число";
	*/


	//Задание 4
	/*int a, b, c, c1, a1, b1;
	std::cout << "Введите расстояние между пунктами А и Б в киллометрах\n";
	std::cin >> a;
	if (a > 300)
	{
		std::cout << "Вам не хватит топлива чтоб долететь из пункта А в пункт Б\n";
		exit(0);
	}
	std::cout << "Введите расстояние между пунктами Б и С в киллометрах\n";
	std::cin >> b;
	if (b > 300)
	{
		std::cout << "Вам не хватит топлива чтоб долететь из пункта Б в пункт С\n";
		exit(0);
	}
	std::cout << "Введите вес перевозимого груза в килограммах\n";
	std::cin >> c;

		if (a < 300)
	{
		a* c;
		
	}
	
	if (b < 300)
	{
		b* c;
	}
	
	if (c < 500)
	{
		c = 1;
	}
	else if (c > 500 && c < 1000)
	{
		c = 4;
	}
	else if (c > 1000 && c < 1500)
	{
		c = 7;
	}
	else if (c > 1500 && c < 2000)
	{
		c = 9;
	}
	else if  (c > 2001)
	{
		std::cout << " 5 Полет не возможет,превышен лимит веса груза";
		exit(0);
	}
	a1 = a * c;
	b1 = b * c;
	if (a1 < 300)
	{
		std::cout << a1 << " Литров вам надо чтобы долететь из пункта А в пункт Б\n";
	}
	else if (a1 > 301)
	{
		std::cout << " Вам не хватит топлива чтоб долететь из пункта А в пункт Б\n";
		exit(0);
	}
	if (b1 < 300)
	{
		std::cout << b1 << " Литров вам надо чтобы долететь из пункта Б в пункт С \n";
	}
	else if (b1 > 300)
	{
		std::cout << " Вам не хватит топлива чтоб долететь из пункта Б в пункт С\n";
		exit(0);
	}


	

	
	

	
	return 0 ;
	
	}*/